# Introduction to Pandas

Complete the following set of exercises to solidify your knowledge of Pandas fundamentals.

#### 1. Import Numpy and Pandas and alias them to `np` and `pd` respectively.

In [1]:
import numpy as np
import pandas as pd

In [2]:
!pip3 install pandas --upgrade

Requirement already up-to-date: pandas in /Library/Frameworks/Python.framework/Versions/3.7/lib/python3.7/site-packages (1.0.1)
Requirement already satisfied, skipping upgrade: pytz>=2017.2 in /Library/Frameworks/Python.framework/Versions/3.7/lib/python3.7/site-packages (from pandas) (2019.3)
Requirement already satisfied, skipping upgrade: python-dateutil>=2.6.1 in /Library/Frameworks/Python.framework/Versions/3.7/lib/python3.7/site-packages (from pandas) (2.8.1)
Requirement already satisfied, skipping upgrade: numpy>=1.13.3 in /Library/Frameworks/Python.framework/Versions/3.7/lib/python3.7/site-packages (from pandas) (1.18.1)
Requirement already satisfied, skipping upgrade: six>=1.5 in /Library/Frameworks/Python.framework/Versions/3.7/lib/python3.7/site-packages (from python-dateutil>=2.6.1->pandas) (1.13.0)

In [3]:
pd.__version__

'1.0.1'

#### 2. Create a Pandas Series containing the elements of the list below.

In [4]:
lst = [5.7, 75.2, 74.4, 84.0, 66.5, 66.3, 55.8, 75.7, 29.1, 43.7]

In [5]:
data = pd.Series(lst)

#### 3. Use indexing to return the third value in the Series above.

*Hint: Remember that indexing begins at 0.*

In [6]:
data

0     5.7
1    75.2
2    74.4
3    84.0
4    66.5
5    66.3
6    55.8
7    75.7
8    29.1
9    43.7
dtype: float64

In [7]:
data[2]

74.4

#### 4. Create a Pandas DataFrame from the list of lists below. Each sublist should be represented as a row.

In [11]:
b = [[53.1, 95.0, 67.5, 35.0, 78.4],
     [61.3, 40.8, 30.8, 37.8, 87.6],
     [20.6, 73.2, 44.2, 14.6, 91.8],
     [57.4, 0.1, 96.1, 4.2, 69.5],
     [83.6, 20.5, 85.4, 22.8, 35.9],
     [49.0, 69.0, 0.1, 31.8, 89.1],
     [23.3, 40.7, 95.0, 83.8, 26.9],
     [27.6, 26.4, 53.8, 88.8, 68.5],
     [96.6, 96.4, 53.4, 72.4, 50.1],
     [73.7, 39.0, 43.2, 81.6, 34.7]]

In [12]:
data2 = pd.DataFrame(b)

In [13]:
data2

      0     1     2     3     4
0  53.1  95.0  67.5  35.0  78.4
1  61.3  40.8  30.8  37.8  87.6
2  20.6  73.2  44.2  14.6  91.8
3  57.4   0.1  96.1   4.2  69.5
4  83.6  20.5  85.4  22.8  35.9
5  49.0  69.0   0.1  31.8  89.1
6  23.3  40.7  95.0  83.8  26.9
7  27.6  26.4  53.8  88.8  68.5
8  96.6  96.4  53.4  72.4  50.1
9  73.7  39.0  43.2  81.6  34.7

#### 5. Rename the data frame columns based on the names in the list below.

In [14]:
colnames = ['Score_1', 'Score_2', 'Score_3', 'Score_4', 'Score_5']

In [15]:
data2 = pd.DataFrame(b, columns = colnames)

In [16]:
data2

   Score_1  Score_2  Score_3  Score_4  Score_5
0     53.1     95.0     67.5     35.0     78.4
1     61.3     40.8     30.8     37.8     87.6
2     20.6     73.2     44.2     14.6     91.8
3     57.4      0.1     96.1      4.2     69.5
4     83.6     20.5     85.4     22.8     35.9
5     49.0     69.0      0.1     31.8     89.1
6     23.3     40.7     95.0     83.8     26.9
7     27.6     26.4     53.8     88.8     68.5
8     96.6     96.4     53.4     72.4     50.1
9     73.7     39.0     43.2     81.6     34.7

#### 6. Create a subset of this data frame that contains only the Score 1, 3, and 5 columns.

In [17]:
data2[['Score_1','Score_3','Score_5']]

   Score_1  Score_3  Score_5
0     53.1     67.5     78.4
1     61.3     30.8     87.6
2     20.6     44.2     91.8
3     57.4     96.1     69.5
4     83.6     85.4     35.9
5     49.0      0.1     89.1
6     23.3     95.0     26.9
7     27.6     53.8     68.5
8     96.6     53.4     50.1
9     73.7     43.2     34.7

#### 7. From the original data frame, calculate the average Score_3 value.

In [18]:
data2.mean()['Score_3']

56.95000000000001

#### 8. From the original data frame, calculate the maximum Score_4 value.

In [19]:
data2.max()['Score_4']

88.8

#### 9. From the original data frame, calculate the median Score 2 value.

In [20]:
data2.median()['Score_2']

40.75

#### 10. Create a Pandas DataFrame from the dictionary of product orders below.

In [22]:
orders = {'Description': ['LUNCH BAG APPLE DESIGN',
  'SET OF 60 VINTAGE LEAF CAKE CASES ',
  'RIBBON REEL STRIPES DESIGN ',
  'WORLD WAR 2 GLIDERS ASSTD DESIGNS',
  'PLAYING CARDS JUBILEE UNION JACK',
  'POPCORN HOLDER',
  'BOX OF VINTAGE ALPHABET BLOCKS',
  'PARTY BUNTING',
  'JAZZ HEARTS ADDRESS BOOK',
  'SET OF 4 SANTA PLACE SETTINGS'],
 'Quantity': [1, 24, 1, 2880, 2, 7, 1, 4, 10, 48],
 'UnitPrice': [1.65, 0.55, 1.65, 0.18, 1.25, 0.85, 11.95, 4.95, 0.19, 1.25],
 'Revenue': [1.65, 13.2, 1.65, 518.4, 2.5, 5.95, 11.95, 19.8, 1.9, 60.0]}

In [23]:
data3 = pd.DataFrame(orders)

In [24]:
data3

                          Description  Quantity  UnitPrice  Revenue
0              LUNCH BAG APPLE DESIGN         1       1.65     1.65
1  SET OF 60 VINTAGE LEAF CAKE CASES         24       0.55    13.20
2         RIBBON REEL STRIPES DESIGN          1       1.65     1.65
3   WORLD WAR 2 GLIDERS ASSTD DESIGNS      2880       0.18   518.40
4    PLAYING CARDS JUBILEE UNION JACK         2       1.25     2.50
5                      POPCORN HOLDER         7       0.85     5.95
6      BOX OF VINTAGE ALPHABET BLOCKS         1      11.95    11.95
7                       PARTY BUNTING         4       4.95    19.80
8            JAZZ HEARTS ADDRESS BOOK        10       0.19     1.90
9       SET OF 4 SANTA PLACE SETTINGS        48       1.25    60.00

#### 11. Calculate the total quantity ordered and revenue generated from these orders.

In [26]:
data3.sum()[['Quantity','Revenue']]

Quantity    2978
Revenue      637
dtype: object

#### 12. Obtain the prices of the most expensive and least expensive items ordered and print the difference.

In [27]:
print('Most expensive:', data3.max()['UnitPrice'])

Most expensive: 11.95

In [28]:
print('Least expensive:', data3.min()['UnitPrice'])

Least expensive: 0.18

# BONUS

#### 1 Create a random dataframe containing 3 columns and 10 rows. 

*Hint: You'll have to use a `numpy.random` method to create random observations*

In [29]:
df = pd.DataFrame(np.random.random((10,3)))

In [30]:
df

          0         1         2
0  0.044311  0.610549  0.317975
1  0.792929  0.505513  0.103459
2  0.935349  0.960477  0.259447
3  0.588814  0.472116  0.581702
4  0.247141  0.613759  0.353330
5  0.839423  0.429627  0.639897
6  0.707384  0.669208  0.539690
7  0.341433  0.626176  0.127451
8  0.021623  0.073759  0.421797
9  0.428618  0.787245  0.527677

#### 2 Create a random dataframe containing 3 columns and 10 rows with specific column names. 

Use `['column1', 'column2', 'column3']` as the column names.

In [35]:
df2 = pd.DataFrame(np.random.random((10,3)), columns = ['column1','column2','column3'])

In [36]:
df2

    column1   column2   column3
0  0.187885  0.956358  0.038104
1  0.837479  0.773260  0.766137
2  0.442073  0.522682  0.175758
3  0.022654  0.141991  0.645858
4  0.046718  0.551467  0.318429
5  0.803906  0.110940  0.485901
6  0.142905  0.766770  0.085179
7  0.305622  0.004944  0.238342
8  0.765680  0.090350  0.491664
9  0.576356  0.152196  0.682048

#### 3 Create a random dataframe containing N columns and M rows with specific column names.

For this task you'll have to name the columns as `['column1', 'column2', 'column3', ...,'columnN']`. You can use a list comprehension to do that.

In [37]:
N = 10
M = 10

[str(i) for i in range(N)]

colunas = ['column' + str(i) for i in range(N)]

df3 = pd.DataFrame(np.random.random((M,N)), columns = colunas)
df3

,column0,column1,column2,column3,column4,column5,column6,column7,column8,column9
0,0.395368,0.599775,0.499092,0.115664,0.630178,0.648733,0.502680,0.341579,0.727354,0.664079
1,0.454489,0.899919,0.446719,0.421244,0.732709,0.934082,0.731664,0.183161,0.620952,0.198965
2,0.652779,0.598654,0.391962,0.487519,0.699196,0.213632,0.336657,0.477653,0.007794,0.787761
3,0.432717,0.739474,0.487807,0.576701,0.264059,0.711134,0.907703,0.065835,0.379493,0.689962
4,0.308310,0.584103,0.552850,0.245141,0.570190,0.229837,0.897348,0.045265,0.331721,0.833226
5,0.323152,0.528226,0.743532,0.802933,0.421020,0.431828,0.048679,0.700196,0.142290,0.455602
6,0.626258,0.090104,0.281557,0.041149,0.123676,0.113136,0.118355,0.879141,0.470255,0.707307
7,0.515546,0.695190,0.142684,0.767052,0.534118,0.708066,0.292072,0.968204,0.974593,0.423874
8,0.533244,0.513693,0.957835,0.153489,0.493309,0.743204,0.229337,0.654631,0.304879,0.792630
9,0.234171,0.702856,0.148416,0.838044,0.221303,0.276600,0.009207,0.183322,0.001778,0.394199